模块一：
1. 登录
2. 注册

模块二：
租地：
1. 选择大鹏（1. 有棚托管 2. 无棚托管 3. 有棚非托管 4. 无棚非托管） - 对应的四种价格模式
2. 大鹏->地（1->N）:选择某一个地块

这里可以重复利用的模块包括后面会讲到的管理员的图片上传：
选择大棚->选择土地，摄影包含每周的生长实时状况（一周一次），农场人员选定地块，拍摄照片，上传高清照片，等待后台approve，对用户才可见

模块三：
用户选择地块之后购买，支付（支付宝或者微信支付）

模块四：
用户菜园的管理：
1. 根据用户购买的时节，推荐整年周期的种菜（用户可见overall的schedule）
2. 用户可以根据自己的喜好进行更新，系统会根据用户的更新做整体的调整
3. 用户可以选择系统提供的列表，同时可以查看每个菜的基本信息（生长周期，大约的产量等等），同时可见系统中用户对于它的评价列表，同时也支持评价


模块五：
私人菜园菜的管理：
1. 可见该菜的基本信息（播种的时间，大约收割的时间），跟模块四中菜的基本信息一致
2. 同时在in progress中可见菜的实时实时生长状态，主要以每周一图的方式进行更新


模块六：
直播模块：
1. 借助第三方直播软件来发布直播
2. 系统只负责发布link做入口和schedule
3. 选择某一种sdk作为监控设备来支持另外一种形式的直播（后续调研选择）

模块七：
数据展示模块
1. 要让客户直观的看到30平方或者50平方能够给他带来多少的产出
2. 以图表的形式告诉用户，超出他的预期

模块八：
配送模块：
1. 以好尔万家的模式，但是进行改进
2. 以小区便利店切入，进行寄存
